# = 代表赋值运算符不是数学上的相等
# 作用是把 = 右侧的值，赋值给=左侧的变量（属性）
a = 10  #把10的地址值赋值给a
b = a  #把a里面的地址值赋值给b


# 复合赋值运算符
# +=  -=  *=  /=  //=  %=  **=       :=
num = 100
num += 10  # num = num + 10
print(num)
num -= 10  # num = num - 10
print(num)
num **= 3  # num = num ** 3
print(num)

# 任何表达式的特点是有值的，赋值表达式是没办法去直接打印值的,要想打印赋值表达式的值，那么需要海象运算
# num1 = 30
# print(num1)
print((num1 := 30))


# num2 = 100
# if num2 > 100:
#     pass


if num2 := 100 > 100:
    pass

# 海象运算其实就是两步操作 先给变量赋值，再用变量进行后续的运算操作
# 就是一种简写罢了
















