# 变量的访问
# 作用域：变量起作用的范围区域
# a = 100
# b = 200
# c = 300
# d = 400
# # 最外层是全局作用域
# def fn():
#     # 嵌套作用域
#     a = 10
#     b = 20
#     c = 30
#     print(c,d,"fn里面的打印")
#     def fn1():
#         # 局部作用域
#         a = 1000
#         b = 2000
#         print(a,b,c,d,"fn1里面的打印")
#
#     fn1()
# fn()
#
# print(a,b,c,d,"全局打印的")

# 当我们在访问变量的时候，访问的顺序  函数内部访问变量：从内往外去找
# 最内部属于局部作用域，访问变量的过程，先找自己，自己有就打印自己的，自己没有，向上找，找嵌套作用域
# 嵌套里面有，就打印嵌套的变量，如果没有，继续往外找，找全局，全局有就打印，没有炸



# 变量的修改
# 牵扯到修改，就会牵扯不同作用域当中的变量修改 比如在嵌套当中要改全局  局部当中要改嵌套  局部当中改全局
a = 100
b = 200
c = 300
d = 400
# 最外层是全局作用域
def fn():
    global a
    # 嵌套作用域
    a = 10  #本意并不是想定义一个变量a 而是想修改全局的a,此时需要一个声明 global
    b = 20
    c = 30
    print(c,d,"fn里面的打印")
    def fn1():
        global d
        nonlocal c
        # 局部作用域
        a = 1000
        b = 2000
        c = 3000 #修改嵌套的c 不是想定义c
        d = 4000
        print(a,b,c,d,"fn1里面的打印")

    fn1()
fn()

print(a,b,c,d,"全局打印的")











